# Inroduction To Pandas...

In [1]:
import pandas as pd

# DatatypeOne: Series

    >_  Series are One-Dimensional, (axis-1)...

In [2]:
space_companies = pd.Series(["Rocket Lab", "NASA", "SpaceX", "Blue Origin", "Axiom Space", "AI Spacefactory", "ASAI Inc."])

In [3]:
space_companies

0         Rocket Lab
1               NASA
2             SpaceX
3        Blue Origin
4        Axiom Space
5    AI Spacefactory
6          ASAI Inc.
dtype: object

In [4]:
space_projects = pd.Series(["Neutron Rocket", "NASA Artemis", "Project Starship", "Blue Moon", "ISS Development Facilities", "Advanced Inter-Planetary Home Design" "Space Research"])

In [5]:
space_projects

0                                       Neutron Rocket
1                                         NASA Artemis
2                                     Project Starship
3                                            Blue Moon
4                           ISS Development Facilities
5    Advanced Inter-Planetary Home DesignSpace Rese...
dtype: object

# DatatypeTwo: DataFrame

     >_ DataFrames are Two-Dimensional, (axis-0 & axis-1)...

In [6]:
current_progress = pd.DataFrame({"Space Companies": space_companies, "Projects": space_projects})
current_progress

   Space Companies                                           Projects
0       Rocket Lab                                     Neutron Rocket
1             NASA                                       NASA Artemis
2           SpaceX                                   Project Starship
3      Blue Origin                                          Blue Moon
4      Axiom Space                         ISS Development Facilities
5  AI Spacefactory  Advanced Inter-Planetary Home DesignSpace Rese...
6        ASAI Inc.                                                NaN

# Importing data...

In [7]:
car_data = pd.read_csv("src/car-sales.csv")

In [8]:
car_data

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

    >_  (.csv) files are the standard of data files in AI & ML...

    >_  You can also provide an URL of the ".csv" file in the FileName parameter...

In [9]:
heart_data = pd.read_csv("src/heart_disease.csv")

In [10]:
heart_data

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

    >_  The files should be in the same directory as source...

# Exporting DataFrame...

In [11]:
car_data.to_csv("tests/Updated-Car-Data.csv", index = False)

    >_ You can export into many file formats like as, excel files[VariableName.to_FileType("NewFileName", index=False)]...

Verify file export...

In [15]:
updated_car_data = pd.read_csv("tests/Updated-Car-Data.csv")
updated_car_data

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

    >_  If you'll not include [index=False], the exported data's index will be messed up!

# Describing the data...

### Attribute

In [16]:
car_data.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

### Function

    >_   CarData.to_csv()

In [17]:
car_columns = car_data.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [21]:
car_index = car_data.index
car_index

RangeIndex(start=0, stop=10, step=1)

In [36]:
car_data.describe()       # car_data.describe  will also work...

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [37]:
car_data.info()     # car_data.info  will not work...

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [38]:
car_data.mean()

C:\Users\samsk\AppData\Local\Temp/ipykernel_8408/2755274948.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  car_data.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

### Average  \  Mean

In [39]:
car_prices = pd.Series([3200, 4500, 3245, 4532])
car_prices.mean()

3869.25

In [42]:
car_prices.sum()

15477

In [45]:
car_data.sum()      # :) :) :)

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [46]:
car_data["Doors"].sum()

40

In [47]:
car_data["Price"].sum()

'$4,000.00$5,000.00$7,000.00$22,000.00$3,500.00$4,500.00$7,500.00$7,000.00$6,250.00$9,700.00'

In [48]:
car_data["Odometer (KM)"].sum()

786014

In [49]:
len(car_data)

10

In [50]:
car_data

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# Selecting & Viewing Data

    >_   The First Five...

In [51]:
car_data.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [52]:
car_data.head(3)

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

    >_   The Last Five...

In [53]:
car_data.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [54]:
car_data.tail(7)

     Make Colour  Odometer (KM)  Doors       Price
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## .loc & .iloc

    >_  .loc refers to Index...
    >_  .iloc refers to position...

In [32]:
animals = pd.Series(["Dragon", "Dinosour", "Panda", "Dog", "Cat", "Horse"])
animals

0      Dragon
1    Dinosour
2       Panda
3         Dog
4         Cat
5       Horse
dtype: object

In [33]:
animals.loc[3]

'Dog'

In [34]:
animals[3]

'Dog'

    >_  Custom Index...

In [35]:
animals = pd.Series(["Dragon", "Dinosour", "Panda", "Dog", "Cat", "Horse"], index = [3, 6, 9, 3, 36, 99])
animals

3       Dragon
6     Dinosour
9        Panda
3          Dog
36         Cat
99       Horse
dtype: object

In [36]:
animals[3]

3    Dragon
3       Dog
dtype: object

In [37]:
animals.loc[3]

3    Dragon
3       Dog
dtype: object

In [38]:
animals.iloc[3]

'Dog'

In [39]:
CarData

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [40]:
CarData.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [41]:
CarData.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

    >_  Can use list slicing also but, head() & tail() are awesome...

In [42]:
CarData.loc[:3]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [44]:
CarData.iloc[:3]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

    >_  Extracting Columns...

In [56]:
CarData

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [48]:
CarData.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

    >_  Works on the topics with whitespaces also...

In [54]:
CarData["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

    >_  Filter with condition...

In [58]:
CarData[CarData["Make"] == "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [59]:
CarData[CarData["Make"] == "BMW"]

  Make Colour  Odometer (KM)  Doors       Price
3  BMW  Black          11179      5  $22,000.00

In [61]:
CarData[CarData["Odometer (KM)"] > 100000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [62]:
pd.crosstab(CarData["Make"], CarData["Doors"])

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

    >_ I think that i should focus on build a model first rather than perfecting each skill...